
// init jquery
window.jQuery || document.write(decodeURIComponent('%3Cscript src="js/jquery.min.js"%3E%3C/script%3E'))

$(function () {
    $("#gridContainer").dxDataGrid({
        dataSource: customers,
        columns: ["상태", "구분", "거치대", "자전거ID", "제조사", "모델명", "사용자", "연락처", "입고시간", "출고시간", "시간", "요금"],
        allowColumnResizing: true,
        columnResizingMode: "widget",
        showBorders: true,
        height: 150
    });

    $("#gridContainer2").dxDataGrid({
        dataSource: customers2,
        columns: ["대여일시", "대여자명", "연락처", "자전거ID", "차대번호", "제조사", "모델명", "색상", "시간", "요금"],
        allowColumnResizing: true,
        columnResizingMode: "widget",
        showBorders: true,
        height: 100
    })

    $("#gridContainer3").dxDataGrid({
        dataSource: customers3,
        columns: ["지역1", "지역2", "스테이션", "거치대", "통신상태", "내부온도", "개인보관", "공영보관", "대기", "폐쇄", "충전중", "당일보관", "당일대여", "상태", "확인시간"],
        allowColumnResizing: true,
        columnResizingMode: "widget",
        showBorders: true,
        height: 150
    })

    $("#gridContainer4").dxDataGrid({
        dataSource: customers4,
        columns: ["발행시간", "발생신호", "스테이션", "거치대", "사용자ID", "사용자이름", "자전거ID", "자전거구분", "형태"],
        allowColumnResizing: true,
        columnResizingMode: "widget",
        showBorders: true,
        height: 150
    })
});


var customers = [
    {
        "상태": "반납",
        "구분": "공영자전거",
        "거치대": "5",
        "자전거ID": "102.0.6.19",
        "제조사": "삼천리",
        "모델명": "나무",
        "사용자": "",
        "연락처": "",
        "입고시간": "2020-02-10 18:47:38",
        "출고시간": "",
        "시간": "00:00",
        "요금": "0"
    },
    {
        "상태": "반납",
        "구분": "공영자전거",
        "거치대": "1",
        "자전거ID": "102.0.6.19",
        "제조사": "삼천리",
        "모델명": "나무",
        "사용자": "변종섭",
        "연락처": "010-555-2797",
        "입고시간": "2020-02-10 18:42:30",
        "출고시간": "",
        "시간": "00:00",
        "요금": "0"
    },
    {
        "상태": "반납",
        "구분": "공영자전거",
        "거치대": "5",
        "자전거ID": "102.0.6.19",
        "제조사": "삼천리",
        "모델명": "나무",
        "사용자": "변종섭",
        "연락처": "010-555-2797",
        "입고시간": "",
        "출고시간": "2020-02-10 18:41:11",
        "시간": "",
        "요금": ""
    },
    {
        "상태": "반납",
        "구분": "공영자전거",
        "거치대": "5",
        "자전거ID": "102.0.6.19",
        "제조사": "삼천리",
        "모델명": "나무",
        "사용자": "변종섭",
        "연락처": "010-555-2797",
        "입고시간": "2020-02-10 18:10:20",
        "출고시간": "",
        "시간": "00:00",
        "요금": "0"
    },
];

var customers2 = [
    {
        "대여일시":"",
        "대여자명":"",
        "연락처":"",
        "자전거ID":"",
        "차대번호":"",
        "제조사":"",
        "모델명":"",
        "색상":"",
        "시간":"",
        "요금":""
    }
];

var customers3 = [
    {
        "지역1":"성남시",
        "지역2":"분당구",
        "스테이션":"스타트업캠퍼스",
        "거치대":"6",
        "통신상태":"통신양호",
        "내부온도":"40",
        "개인보관":"",
        "공영보관":"",
        "대기":"5",
        "폐쇄":"",
        "충전중":"",
        "당일보관":"",
        "당일대여":"",
        "상태":"공실률 60%",
        "확인시간":""
    }
];

var customers4 = [
    {
        "발행시간":"2020-02-03 14:20:30",
        "발생신호":"자전거 입고 경고",
        "스테이션":"스타트업캠퍼스",
        "거치대":"6",
        "사용자ID":"",
        "사용자이름":"",
        "자전거ID":"",
        "자전거구분":"",
        "형태":""
    }
]
